import { ChatHistory } from "../model/chat-history.model";

export const CHATHISTORY:ChatHistory[]= [
  { id: 1, title: 'نصائح تصميم الشعار' },
  { id: 2, title: 'رحلة لمدة 3 أيام إلى البرتغال' },
  { id: 3, title: 'كيفية استخدام الرموز بفعالية' },
  { id: 4, title: 'أهمية التجربة البصرية للمستخدم' },
  { id: 5, title: 'استراتيجيات التصميم القابلة للتكيف' },
  { id: 6, title: 'أهمية الفضاء السلبي في التصميم' },
  { id: 7, title: 'تأثير الخطوط على الهوية البصرية' },
  { id: 8, title: 'استراتيجيات اختيار الألوان' },
  { id: 9, title: 'تأثير الشبكات الاجتماعية على تصميم ...' },
  { id: 10, title: 'أهمية البحث في تصميم العلامة التجارية...' },
  { id: 11, title: 'دور التنوع الثقافي في التصميم' },
  { id: 12, title: 'كيفية تحقيق التوازن بين الحداثة والتقليد...' },
  { id: 13, title: 'تحديات تصميم الشعارات في العصر الحديث...' },
];
